---
kind: property
id: P:Autodesk.Revit.DB.BuiltInFailures.RoofFailures.CurveRoofSkippedLoopsError
source: html/7afc334d-334d-1969-6db8-7a6a83a14947.htm
---
# Autodesk.Revit.DB.BuiltInFailures.RoofFailures.CurveRoofSkippedLoopsError Property

Some loops were skipped

## Syntax (C#)
```csharp
public static FailureDefinitionId CurveRoofSkippedLoopsError { get; }
```